[
  {
    "Name": "Hex SiFi Shield",
    "Preview": "HexShieldPreview.mp4",
    "Images": ["HexShield1.mp4"],
    "Tags": ["vfx"],
    "Description": "Эффект представляет собой гексагональную энерго-сферу с двуслойным свечением: тёплым внутренним ядром и холодным внешним контуром. Структура включает анимированные контуры, пульсирующее свечение и разлетающиеся фрагменты. Визуально напоминает активируемый энергетический щит или высокотехнологичную защитную оболочку."
  },
  {
    "Name": "Plasma Gun",
    "Preview": "PlasmaGunPreview.mp4",
    "Images": ["PlasmaGun1.mp4"],
    "Tags": ["vfx"],
    "Description": "Эффект представляет собой выстрел энергетического снаряда с яркой вспышкой в точке вылета и последующим линейным следом из быстро затухающего глоу-трейла. Снаряд движется к мишени по прямой траектории, создавая короткие эмиссии искр. При контакте с поверхностью фиксируется лёгкий импакт-флэш."
  },
  {
    "Name": "Water Tunel",
    "Preview": "WaterTunelPreview.mp4",
    "Images": ["WaterTunel1.mp4"],
    "Tags": ["vfx"],
    "Description": "Эффект представляет собой динамический водный тоннель с выраженной воронкой: центральная зона окрашена в насыщенный бирюзовый, по периметру формируется интенсивная белая пенная турбулентность. Поток закручивается по спирали, создавая ощущение сильного всасывающего движения. Освещение подчёркивает глубину и плотность воды, усиливая эффект объёмной циркуляции."
  },
  {
    "Name": "Fireworks",
    "Preview": "FireworksPreview.mp4",
    "Images": ["Fireworks1.mp4", "Fireworks2.png"],
    "Tags": ["vfx"],
    "Description": "Эффект представляет собой имитацию пиротехнического шоу с использованием частиц. Визуализированы сферические взрывы золотистых искр, расходящихся радиально от центральной точки. Наблюдается интенсивное свечение и рассеивание частиц в пространстве, создающее эффект мерцания и динамичного движения на темном фоне. Присутствуют элементы дыма или тумана, усиливающие визуальную глубину."
  },
  {
    "Name": "Fire Ring",
    "Preview": "FireRingPreview.mp4",
    "Images": ["FireRing1.mp4"],
    "Tags": ["vfx"],
    "Description": "На изображении демонстрируется динамический визуальный эффект, характеризующийся радиальным расширением кольцевидной структуры, состоящей из частиц высокой энергии (предположительно, плазмы).  Кольцо подвергается фрагментации с последующим рассеянием отдельных элементов, что указывает на нестабильность и диссипацию энергии. Эффект визуализирован в спектре красных оттенков на темном фоне."
  },
  {
    "Name": "Game of Life",
    "Preview": "GOLPreview.mp4",
    "Images": ["GOL1.mp4", "GOL2.png"],
    "Tags": ["games"],
    "Description": "Изображение демонстрирует визуализацию клеточного автомата \"Игра Жизни\" (Game of Life). Реализация выполнена с использованием Compute Shaders, что позволяет параллельно обрабатывать состояние каждой ячейки сетки.  Наблюдается динамическая эволюция паттернов на основе простых правил выживания и размножения клеток, отображенных в виде светящихся объектов на темном фоне."
  }
]
