[
  {
    "Name": "Hex SiFi Shield",
    "Preview": "HexShieldPreview.mp4",
    "Images": ["HexShield1.mp4"],
    "Tags": ["vfx"],
    "Description": "Эффект представляет собой гексагональную энерго-сферу с двуслойным свечением: тёплым внутренним ядром и холодным внешним контуром. Структура включает анимированные контуры, пульсирующее свечение и разлетающиеся фрагменты. Визуально напоминает активируемый энергетический щит или высокотехнологичную защитную оболочку."
  },
  {
    "Name": "Plasma Gun",
    "Preview": "PlasmaGunPreview.mp4",
    "Images": ["PlasmaGun1.mp4"],
    "Tags": ["vfx"],
    "Description": "Эффект представляет собой выстрел энергетического снаряда с яркой вспышкой в точке вылета и последующим линейным следом из быстро затухающего глоу-трейла. Снаряд движется к мишени по прямой траектории, создавая короткие эмиссии искр. При контакте с поверхностью фиксируется лёгкий импакт-флэш."
  },
  {
    "Name": "Water Tunel",
    "Preview": "WaterTunelPreview.mp4",
    "Images": ["WaterTunel1.mp4"],
    "Tags": ["vfx"],
    "Description": "Эффект представляет собой динамический водный тоннель с выраженной воронкой: центральная зона окрашена в насыщенный бирюзовый, по периметру формируется интенсивная белая пенная турбулентность. Поток закручивается по спирали, создавая ощущение сильного всасывающего движения. Освещение подчёркивает глубину и плотность воды, усиливая эффект объёмной циркуляции."
  },
  {
    "Name": "Fireworks",
    "Preview": "FireworksPreview.mp4",
    "Images": ["Fireworks1.mp4", "Fireworks2.png"],
    "Tags": ["vfx"],
    "Description": "Эффект представляет собой имитацию пиротехнического шоу с использованием частиц. Визуализированы сферические взрывы золотистых искр, расходящихся радиально от центральной точки. Наблюдается интенсивное свечение и рассеивание частиц в пространстве, создающее эффект мерцания и динамичного движения на темном фоне. Присутствуют элементы дыма или тумана, усиливающие визуальную глубину."
  },
  {
    "Name": "Fire Ring",
    "Preview": "FireRingPreview.mp4",
    "Images": ["FireRing1.mp4"],
    "Tags": ["vfx"],
    "Description": "На изображении демонстрируется динамический визуальный эффект, характеризующийся радиальным расширением кольцевидной структуры, состоящей из частиц высокой энергии (предположительно, плазмы).  Кольцо подвергается фрагментации с последующим рассеянием отдельных элементов, что указывает на нестабильность и диссипацию энергии. Эффект визуализирован в спектре красных оттенков на темном фоне."
  },
  {
    "Name": "Game of Life",
    "Preview": "GOLPreview.mp4",
    "Images": ["GOL1.mp4", "GOL2.png"],
    "Tags": ["games", "procedural", "shaders"],
    "Description": "Изображение демонстрирует визуализацию клеточного автомата \"Игра Жизни\" (Game of Life). Реализация выполнена с использованием Compute Shaders, что позволяет параллельно обрабатывать состояние каждой ячейки сетки.  Наблюдается динамическая эволюция паттернов на основе простых правил выживания и размножения клеток, отображенных в виде светящихся объектов на темном фоне."
  },
  {
    "Name": "Статья \"Координатные пространства\"",
    "Preview": "CSPreview.mp4",
    "Images": ["CS1.png"],
    "Tags": ["articles", "shaders", "materials"],
    "Description": "Статья объясняет базовую концепцию координатных пространств в трёхмерной компьютерной графике — это системы отсчёта с началом (origin) и тремя направляющими осями, в которых определяется позиция и ориентация объектов. Рассмотрены стандартные пространства: World Space (глобальное пространство сцены), Object/Local Space (локальное пространство объекта относительно его пивота), Camera/View Space (система координат камеры) и Tangent Space (локальная система для нормалей и касательной/бинормали у вершин) с объяснением их различий и применения. Обсуждается роль компонента Transform и матриц для преобразования объектов из одного пространства в другое, включая позицию, масштаб и вращение. Приводятся практические примеры использования знаний о пространствах в шейдерах: например, для реализации эффекта снега на поверхности с учётом ориентации нормали и для параллаксных текстур, где координаты объекта переводятся в экранные UV-координаты. Материал ориентирован на разработчиков игр и тех, кто работает с игровыми движками или 3D-графикой, и иллюстрирует, как пространство влияет на визуальные эффекты и поведение шейдеров."
  },
  {
    "Name": "Статья \"Шейдер LCD дисплея\"",
    "Preview": "LCDPrewiev.mp4",
    "Images": ["LCD1.png", "LCD2.png"],
    "Tags": ["articles", "shaders"],
    "Description": "Статья описывает практическую реализацию шейдера имитации LCD-дисплея с техническим разбором этапов создания эффекта на примере ShaderGraph (Unity) и стандартных шейдерных конструкций. Автор показывает, как пикселизировать изображение путём количественной дискретизации UV-координат (stepping/posterization) и преобразовать исходный UV в сетку пикселей путём умножения, округления и обратного деления, что создаёт характерный «растровый» вид. Далее объясняется, как через маскинг и мультимапинг с одной текстурной маской распределить на каждом пикселе три субпикселя RGB, что формирует структуру, аналогичную реальному LCD. Приводятся примеры использования нод для контролирования тайлинга маски в пределах пикселя и альтернативные математические подходы с использованием функций floor() и fract() для более универсального решения. В результате объединения каналов и правильного смещения UV достигается визуальный эффект, имитирующий работу LCD-матрицы. В статье используются технические термины, графическое представление нодов и демонстрируется конечная реализация шейдера, а также даются ссылки на исходный проект и пакет для Unity."
  },
  {
    "Name": "Статья \"Флоумапинг\"",
    "Preview": "FMPreview.mp4",
    "Images": ["FMP1.gif"],
    "Tags": ["articles", "shaders"],
    "Description": "Статья рассказывает об эффекте flow-mapping в компьютерной графике с точки зрения визуального восприятия и практического применения. Автор приводит материал так, чтобы читатель понял, как графические шейдеры могут создавать впечатление движения жидкости или течения поверхности без анимации самой геометрии: это достигается за счёт особых карт направлений, по которым смещаются текстурные координаты. Описано, почему такая техника выглядит естественно, где её используют (в воде, энергии, эффектах движения) и какие идеи стоят за созданием плавных, непрерывных потоков. Статья иллюстрирована примерами и показывает, как даже простые математические преобразования могут кардинально изменить визуальную динамику сцены."
  }
]
